app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    user = User.where(:provider => auth['provider'],
                      :uid => auth['uid'].to_s).first || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("provider", "uid", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["provider", "github"], ["uid", "19621102"], ["name", "Francesco Nunez"], ["created_at", "2016-09-11 13:34:20.996905"], ["updated_at", "2016-09-11 13:34:20.996905"]]
SELECT  "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2  ORDER BY "users"."id" ASC LIMIT 1  [["provider", "github"], ["uid", "19621102"]]